Revit 2024 API
Element.IsExternalFileReference Method
 Determines whether this Element represents an external file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsExternalFileReference()
Visual Basic
Public Function IsExternalFileReference As Boolean
Visual C++
public:
bool IsExternalFileReference()
Return Value
 True if this element contains information about some external file, false if it does not.
Remarks
 Linked files are references to external files, but imported files are not, as their data is brought wholly into Revit.
See Also
Element Class
Autodesk.Revit.DB Namespace